In [131]:
import numpy as np
import pandas as pd
import re
%matplotlib inline

In [3]:
data= pd.read_csv('titanic_train.csv', index_col='PassengerId')

In [4]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
data[(data['Embarked'] == 'C')  & (data.Fare > 200)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
378,0,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.5000,C82,C

In [7]:
data[(data['Embarked'] == 'C') &
     (data['Fare']>200)].sort_values(by= 'Fare',
                                    ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C

In [8]:
def age_category(age):
    '''
    < 30 -> 1
    >= 30, <55 -> 2
    >= 55 -> 3
    '''
    if age < 30:
        return 1
    elif age < 55:
        return 2
    else:
        return 3

In [9]:
age_categories = [age_category(age) for age in data.Age]

In [10]:
data['Age_category'] = age_categories

### Другой способо через aply

In [11]:
data['Age_category'] = data['Age'].apply(age_category)

### 1. Сколько мужчин / женщин находилось на борту?
###### 412 мужчин и 479 женщин
###### 314 мужчин и 577 женщин
##### 479 мужчин и 412 женщин
###### 577 мужчин и 314 женщин

In [12]:
data[(data['Sex'] == 'male') & (data['Sex'] == 'female')].count()

Survived        0
Pclass          0
Name            0
Sex             0
Age             0
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin           0
Embarked        0
Age_category    0
dtype: int64

In [13]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

### Ответ- 577 мужчин 314 женщин

### 2. Выведите распределение переменной Pclass (социально-экономический статус) и это же распределение, только для мужчин / женщин по отдельности. Сколько было мужчин 2-го класса?

In [14]:
data['Pclass'].value_counts(normalize=True)

3    0.551066
1    0.242424
2    0.206510
Name: Pclass, dtype: float64

In [15]:
pd.crosstab(data['Pclass']==2, data['Sex']=='male')

Sex     False  True
Pclass
False     238    469
True       76    108

In [16]:
pd.crosstab(data['Pclass']==2, data['Sex']=='female')

Sex     False  True
Pclass
False     469    238
True      108     76

### Мужчин второго класса было 108 человек

###   3. Каковы медиана и стандартное отклонение платежей (Fare)? Округлите до 2 десятичных знаков.

In [17]:
s=pd.Series(data['Fare'])

In [18]:
s.median()

14.4542

In [19]:
np.around(s.median(), decimals=2)

14.45

In [20]:
s.std()

49.693428597180905

In [21]:
np.around(s.std(), decimals=2)

49.69

### 4. Правда ли, что люди моложе 30 лет выживали чаще, чем люди старше 60 лет? Каковы доли выживших в обеих группах?
##### -22.7% среди молодых и 40.6% среди старых
##### -40.6% среди молодых и 22.7% среди старых
##### -35.3% среди молодых и 27.4% среди старых
##### -27.4% среди молодых и 35.3% среди старых

In [85]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2

In [87]:
data[data['Age']<30].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,1
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,1
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,1

In [88]:
data[data['Age']>60].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S,3
55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C,3
97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,3
117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q,3
171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S,3

In [95]:
data[data['Age']>60][data['Survived']==1].head()

D:\WPy64-3760\python-3.7.6.amd64\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,3
484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S,3
571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S,3
631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,3
830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN,3

In [98]:
data.groupby('Survived')['Age']

In [99]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2

In [100]:
man_young=len(data[(data['Survived'] == 1) & (data['Age'] < 30)])

In [101]:
man_young_percent=(man_young*100.0)/len(data[data['Age']<30])

In [102]:
print(man_young_percent)

40.625

In [103]:
man_old=len(data[(data['Survived'] == 1) & (data['Age'] > 60)])

In [104]:
man_old_percent=(man_old*100.0)/len(data[data['Age']>60])

In [105]:
print(man_old_percent)

22.727272727272727

### Правда, кол-во выживших среди молодых больше, чем у старых, 40.625 против 22.72 процентов

### 5. Правда ли, что женщины выживали чаще мужчин? Каковы доли выживших в обеих группах?
###### -30.2% среди мужчин и 46.2% среди женщин
###### -35.7% среди мужчин и 74.2% среди женщин
###### -21.1% среди мужчин и 46.2% среди женщин
###### -18.9% среди мужчин и 74.2% среди женщин

In [107]:
man_surv=len(data[(data['Survived'] == 1) & (data['Sex'] == 'male')])

In [108]:
man_surv_percent=(man_surv*100.0)/len(data[data['Sex'] == 'male'])

In [109]:
print(man_surv_percent)

18.890814558058924

In [110]:
women_surv=len(data[(data['Survived'] == 1) & (data['Sex'] == 'female')])

In [111]:
women_surv_percent=(women_surv*100.0)/len(data[data['Sex'] == 'female'])

In [112]:
print(women_surv_percent)

74.20382165605096

### Ох, живучие же эти бабы, 74.2 процента против 18.9


### 6. Найдите самое популярное имя среди пассажиров Титаника мужского пола?

###### - Charles
###### -Thomas
###### -William
###### -John

In [162]:
moda_name=data['Name'].mode()

In [167]:
c= moda_name.value_counts().argmax()

D:\WPy64-3760\python-3.7.6.amd64\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

In [168]:
print(c)

Wheadon, Mr. Edward H

SyntaxError: invalid syntax (<ipython-input-147-2d4d2110a2a2>, line 5)

Mr.            505
Master.         39
Rev.             6
Dr.              6
Mr               4
Major.           2
Col.             2
George           1
Irving           1
David            1
Pentcho          1
Jonkheer.        1
Don.             1
Capt.            1
Berk             1
Louis            1
Philip           1
William          1
Wennerstrom      1
Henry            1
Name: Name, dtype: int64